c-base/floppy_orgel/firmware/stm32f407/portable/main.c
  /* Now the USAR6_InitStruct is used to define the
   * properties of USART1
   */
  USART_InitStruct.USART_BaudRate = baudrate;       // the baudrate is set to the value we passed into this init function
  USART_InitStruct.USART_WordLength = USART_WordLength_8b;// we want the data frame size to be 8 bits (standard)
  USART_InitStruct.USART_StopBits = USART_StopBits_1;   // we want 1 stop bit (standard)
  USART_InitStruct.USART_Parity = USART_Parity_No;    // we don't want a parity bit (standard)
  USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None; // we don't want flow control (standard)
  USART_InitStruct.USART_Mode = USART_Mode_Tx | USART_Mode_Rx; // we want to enable the transmitter and the receiver
  USART_Init(USART6, &USART_InitStruct);          // again all the properties are passed to the USART_Init function which takes care of all the bit setting

  // finally this enables the complete USART6 peripheral
  USART_Cmd(USART6, ENABLE);
}

unsigned int _USART_getc(USART_TypeDef* USARTx, char* c) {
  if (USARTx->SR & USART_SR_RXNE) {
    // read RX data, combine with DR mask (we only accept a max of 9 Bits)
    *c = USARTx->DR & 0x1FF;
    return 1;
  }
  return 0;
}

// This will print on usart 1 (the original function has been commented out in printf.c !!!
int fputc(signed int c) {
  // Wait until transmit finishes
  while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET);

  // Transmit the character using USART1
  USART_SendData(USART1, (u8) c);
  return c;
}


// Starfield
#define NUM_STARS 512
#define MAX_DEPTH 32
#define SCREEN_RES_X 240
#define SCREEN_RES_Y 320

struct{
	float x;
	float y;
	float z;
} stars[NUM_STARS];

int32_t randrange(int32_t min, int32_t max) {
	return UB_Rng_makeZufall(min, max);
}

void init_stars() {
	// create the starfield
	for(int i = 0; i < NUM_STARS; i++) {
		// A star is represented as a list with this format: [X,Y,Z]
		stars[i].x = randrange(-25, 25);
		stars[i].y = randrange(-25, 25);
		stars[i].z = randrange(1, MAX_DEPTH);
	}
}

void move_and_draw_stars() {
	// Move and draw the stars
	int origin_x = SCREEN_RES_X / 2;
	int origin_y = SCREEN_RES_Y / 2;

	for(int i = 0; i < NUM_STARS; i++) {
		// The Z component is decreased on each frame.
		stars[i].z -= 0.19f;

		// If the star has past the screen (I mean Z<=0) then we
		// reposition it far away from the screen (Z=max_depth)
		// with random X and Y coordinates.
		if(stars[i].z <= 0) {
			stars[i].x = randrange(-25, 25);
			stars[i].y = randrange(-25, 25);
			stars[i].z = MAX_DEPTH;
		}

		// Convert the 3D coordinates to 2D using perspective projection.
		float k = 128.0f / stars[i].z;
		int x = stars[i].x * k + origin_x;
		int y = stars[i].y * k + origin_y;

		// Draw the star (if it is visible in the screen).
		// We calculate the size such that distant stars are smaller than
		// closer stars. Similarly, we make sure that distant stars are
		// darker than closer stars. This is done using Linear Interpolation.

		// 0 <= x < SCREEN_RES_X && 0 <= y < SCREEN_RES_Y
		if( x >= 0 && x < SCREEN_RES_X && y >= 0 && y < SCREEN_RES_Y) {
			int size  = (1 - (float)stars[i].z / MAX_DEPTH) * 5;
			int shade = (1 - (float)stars[i].z / MAX_DEPTH) * 255;

			LCD_SetTextColor(ASSEMBLE_RGB(shade, shade, shade));
			LCD_DrawFullSquare(x, y, size);
		}
	}
}


void drawFrame() {
  LCD_Clear(BLACK);
  move_and_draw_stars();
  //Delay(0x00FFFF);

  // TODO: backbuffered screen update here, to prevent flickering!
}

void debugPrintln(char* text) {
  printf("%s\r\n", text);
}



FRESULT scan_files (char* path)
{
  DIR dirs;
  FRESULT res;
  BYTE i;
  char *fn;
  DWORD acc_size;       /* Work register for fs command */
  WORD acc_files, acc_dirs;
  FILINFO finfo;

  static TCHAR lfname[_MAX_LFN];
  finfo.lfname = lfname;
  finfo.lfsize = 250;

  printf("Opening directory: '%s'\r\n", path);
  if (res = f_opendir(&dirs, path) == FR_OK) {
    i = strlen(path);
    while (((res = f_readdir(&dirs, &finfo)) == FR_OK) && finfo.fname[0]) {
      #if _USE_LFN
        fn = *finfo.fname ? *finfo.lfname != 0 ? finfo.lfname : finfo.fname : finfo.fname;
      #else
        fn = finfo.fname;
      #endif
      if (finfo.fattrib & AM_DIR) {
        acc_dirs++;
        *(path+i) = '/'; strcpy(path+i+1, fn);
        printf("%s\r\n", path);

        res = scan_files(path);
        *(path+i) = '\0';

        if (res != FR_OK) break;
      } else {

        printf("%s/%s - %d KB\r\n", path, fn, (10 * finfo.fsize / 1024) / 10);

        acc_files++;
        acc_size += finfo.fsize;
      }
    }
  }
  else
    printf("Failed opening directory: '%s'.\r\n", path);

  printf("- End of Directory.\r\n");
  for(int i = strlen(path); i > 0; i--) {
    if(path[i] == '/')
      path[i + 1] = '\0';
  }

  return res;
}


uint16_t midiNote2Ticks[] = {
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    64282,
    60675,
    57269,
    54055,
    51021,
    48157,
    45455,
    42903,
    40495,
    38223,
    36077,
    34052,
    32141,
    30337,
    28635,
    27027,
    25511,
    24079,
    22727,
    21452,
    20248,
    19111,
    18039,
    17026,
    16071,
    15169,
    14317,
    13514,
    12755,
    12039,
    11364,
    10726,
    10124,
    9556,
    9019,
    8513,
    8035,
    7584,
    7159,
    6757,
    6378,
    6020,
    5682,
    5363,
    5062,
    4778,
    4510,
    4257,
    4018,
    3792,
    3579,
    3378,
    3189,
    3010,
    2841,
    2681,
    2531,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
};

void playNote(int midi_channel, int midi_note) {
  uint16_t ticks = midiNote2Ticks[midi_note];
  unsigned char data[5] = {0x55, 0xAA, midi_channel, ((char*)&ticks)[1], ((char*)&ticks)[0]};

  for(int i = 0; i < sizeof(data); i++) {
    while (USART_GetFlagStatus(USART6, USART_FLAG_TXE) == RESET); // Wait until transmit finishes
      USART_SendData(USART6, data[i]);
  }
}

