c-base/floppy_orgel/firmware/stm32f407/portable/main.c
/*
def play_note(self, midi_channel, midi_note):
        if midi_channel < 1 or midi_channel > self.MAX_CHANNELS:
            raise Exception("channel '%d' out of range. it has to be between 1 - %d" % (midi_channel, self.MAX_CHANNELS) )

        half_period = self.midiHalfperiods[midi_note]
        midi_channel = (self.midi_channels[midi_channel - 1].floppy_channel - 1)

        prescaler = 8
        crystal_clock = 20000000 # Mhz
        frequency = (2**(1.0/12))**(midi_note - 69) * 440

        if(frequency > 440):
          return

        ticks = round(crystal_clock / (2.0 * prescaler * frequency))

        try:
            data = struct.pack('B', 0x55) + struct.pack('B', 0xAA) + struct.pack('B', midi_channel) + struct.pack('>H', int(ticks))
            self._used_serial_ports[self.midi_channels[midi_channel - 1].serial_port].write(data)
            #print "Playing note: %d on channel: %d" % (frequency, midi_channel)
        except:
            pass #print "serial port error"
*/





// TODO: layout to misc library
typedef struct {
  uint32_t
  TIM2EN   : 1,
  TIM3EN   : 1,
  TIM4EN   : 1,
  TIM5EN   : 1,
  TIM6EN   : 1,
  TIM7EN   : 1,
  TIM12EN  : 1,
  TIM13EN  : 1,
  TIM14EN  : 1,
           : 2,
  WWDGEN   : 1,
           : 2,
  SPI2EN   : 1,
  SPI3EN   : 1,
           : 1,
  USART2EN : 1,
  USART3EN : 1,
  UART4EN  : 1,
  UART5EN  : 1,
  I2C1EN   : 1,
  I2C2EN   : 1,
  I2C3EN   : 1,
           : 1,
  CAN1EN   : 1,
  CAN2EN   : 1,
  PWREN    : 1,
  DACEN    : 1,
           : 2;
} RegSTM32F4_RCC_APB1ENR_t;

void getFileNameFromUart(char* fileName) {
  int fileNameComplete = 0;
  int i = 0;
  int c = '\0';

  while(!fileNameComplete) {
    if(_USART_getc(USART1, &c)) {
      while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // Wait until transmit finishes
        USART_SendData(USART1, c);

      // check for backspace
      if(c == 0x08)
        i = i > 0 ? i - 1: i;

      // check for end of line
      if(c == '\r' || c == '\n') {
        fileName[i] = '\0'; // nulltermination
        fileNameComplete++;
      }
      else {
        fileName[i] = c;
        i++;
      }
    }
  }
}


///////////

void HexList(uint8_t *pData, int32_t iNumBytes) {
  for (int32_t i = 0; i < iNumBytes; i++)
    printf("%.2x ", pData[i]);
}

void printTrackPrefix(uint32_t track, uint32_t tick, char* pEventName)  {
  printf("[Track: %d] %06d %s ", track, tick, pEventName);
}

// Midi Event handlers
char noteName[64]; // TOOD: refactor to const string array

void onNoteOff(int32_t track, int32_t tick, int32_t channel, int32_t note) {
  muGetNameFromNote(noteName, note);
  playNote(channel, 0);

  return;
  printTrackPrefix(track, tick, "Note Off");
  printf("(%d) %s", channel, noteName);
  printf("\n\r");
}

void onNoteOn(int32_t track, int32_t tick, int32_t channel, int32_t note, int32_t velocity) {
  muGetNameFromNote(noteName, note);
  if(velocity > 0)
    playNote(channel, note);
  else
    playNote(channel, 0);

  return;
  printTrackPrefix(track, tick, "Note On");
  printf("(%d) %s [%d] %d", channel, noteName, note, velocity);
  printf("\n\r");
}

void onNoteKeyPressure(int32_t track, int32_t tick, int32_t channel, int32_t note, int32_t pressure) {
  return;

  muGetNameFromNote(noteName, note);
  printTrackPrefix(track, tick, "Note Key Pressure");
  printf("(%d) %s %d", channel, noteName, pressure);
  printf("\n\r");
}

void onSetParameter(int32_t track, int32_t tick, int32_t channel, int32_t control, int32_t parameter) {
  return;

  muGetControlName(noteName, control);
  printTrackPrefix(track, tick, "Set Parameter");
  printf("(%d) %s -> %d", channel, noteName, parameter);
  printf("\n\r");
}

void onSetProgram(int32_t track, int32_t tick, int32_t channel, int32_t program) {
  return;

  muGetInstrumentName(noteName, program);
  printTrackPrefix(track, tick, "Set Program");
  printf("(%d) %s", channel, noteName);
  printf("\n\r");
}

void onChangePressure(int32_t track, int32_t tick, int32_t channel, int32_t pressure) {
  return;

  muGetControlName(noteName, pressure);
  printTrackPrefix(track, tick, "Change Pressure");
  printf("(%d) %s", channel, noteName);
  printf("\n\r");
}

void onSetPitchWheel(int32_t track, int32_t tick, int32_t channel, int16_t pitch) {
  return;

  printTrackPrefix(track, tick, "Set Pitch Wheel");
  printf("(%d) %d", channel, pitch);
  printf("\n\r");
}

void onMetaMIDIPort(int32_t track, int32_t tick, int32_t midiPort) {
  return;

  printTrackPrefix(track, tick, "Meta event ----");
  printf("MIDI Port = %d", midiPort);
  printf("\n\r");
}

void onMetaSequenceNumber(int32_t track, int32_t tick, int32_t sequenceNumber) {
  return;

  printTrackPrefix(track, tick, "Meta event ----");
  printf("Sequence Number = %d", sequenceNumber);
  printf("\n\r");
}

void onMetaTextEvent(int32_t track, int32_t tick, char* pText) {
  return;

  printTrackPrefix(track, tick, "Meta event ----");
  printf("Text = '%s'", pText);
  printf("\n\r");
}

void onMetaCopyright(int32_t track, int32_t tick, char* pText) {
  return;

  printTrackPrefix(track, tick, "Meta event ----");
  printf("Copyright = '%s'", pText);
  printf("\n\r");
}

void onMetaTrackName(int32_t track, int32_t tick, char *pText) {
  return;

  printTrackPrefix(track, tick, "Meta event ----");
  printf("Track name = '%s'", pText);
  printf("\n\r");
}

void onMetaInstrument(int32_t track, int32_t tick, char *pText) {
  return;

  printTrackPrefix(track, tick, "Meta event ----");
  printf("Instrument = '%s'", pText);
  printf("\n\r");
}

void onMetaLyric(int32_t track, int32_t tick, char *pText) {
  return;

  printTrackPrefix(track, tick, "Meta event ----");
  printf("Lyric = '%s'", pText);
  printf("\n\r");
}

void onMetaMarker(int32_t track, int32_t tick, char *pText) {
  return;

  printTrackPrefix(track, tick, "Meta event ----");
  printf("Marker = '%s'", pText);
  printf("\n\r");
}

void onMetaCuePoint(int32_t track, int32_t tick, char *pText) {
  return;

  printTrackPrefix(track, tick, "Meta event ----");
  printf("Cue point = '%s'", pText);
  printf("\n\r");
}

void onMetaEndSequence(int32_t track, int32_t tick) {
  return;

