c-base/floppy_orgel/firmware/stm32f407/portable/main.c
  printTrackPrefix(track, tick, "Meta event ----");
  printf("End Sequence");
  printf("\n\r");
}

void onMetaSetTempo(int32_t track, int32_t tick, int32_t bpm) {
  return;

  printTrackPrefix(track, tick, "Meta event ----");
  printf("Tempo = %d", bpm);
  printf("\n\r");
}

void onMetaSMPTEOffset(int32_t track, int32_t tick, uint32_t hours, uint32_t minutes, uint32_t seconds, uint32_t frames, uint32_t subframes) {
  return;

  printTrackPrefix(track, tick, "Meta event ----");
  printf("SMPTE offset = %d:%d:%d.%d %d", hours, minutes, seconds, frames, subframes);
  printf("\n\r");
}

void onMetaTimeSig(int32_t track, int32_t tick, int32_t nom, int32_t denom, int32_t metronome, int32_t thirtyseconds) {
  return;

  printTrackPrefix(track, tick, "Meta event ----");
  printf("Time sig = %d/%d", nom, denom);
  printf("\n\r");
}

void onMetaKeySig(int32_t track, int32_t tick, uint32_t key, uint32_t scale) {
  return;

  printTrackPrefix(track, tick, "Meta event ----");
  if (muGetKeySigName(noteName, key)) {
    printf("Key sig = %s", noteName);
    printf("\n\r");
  }
}

void onMetaSequencerSpecific(int32_t track, int32_t tick, void* pData, uint32_t size) {
  return;

  printTrackPrefix(track, tick, "Meta event ----");
  printf("Sequencer specific = ");
  HexList(pData, size);
  printf("\n\r");
}

void onMetaSysEx(int32_t track, int32_t tick, void* pData, uint32_t size) {
  return;

  printTrackPrefix(track, tick, "Meta event ----");
  printf("SysEx = ");
  HexList(pData, size);
  printf("\n\r");
}

// TODO: Hide the following functions from user
void dispatchMidiMsg(_MIDI_FILE* midiFile, int32_t track, MIDI_MSG* msg) {
  int32_t eventType = msg->bImpliedMsg ? msg->iImpliedMsg : msg->iType;
  switch (eventType) {
    case  msgNoteOff:
      onNoteOff(track, msg->dwAbsPos, msg->MsgData.NoteOff.iChannel, msg->MsgData.NoteOff.iNote);
      break;
    case  msgNoteOn:
      onNoteOn(track, msg->dwAbsPos, msg->MsgData.NoteOn.iChannel, msg->MsgData.NoteOn.iNote, msg->MsgData.NoteOn.iVolume);
      break;
    case  msgNoteKeyPressure:
      onNoteKeyPressure(track, msg->dwAbsPos, msg->MsgData.NoteKeyPressure.iChannel, msg->MsgData.NoteKeyPressure.iNote, msg->MsgData.NoteKeyPressure.iPressure);
      break;
    case  msgSetParameter:
      onSetParameter(track, msg->dwAbsPos, msg->MsgData.NoteParameter.iChannel, msg->MsgData.NoteParameter.iControl, msg->MsgData.NoteParameter.iParam);
      break;
    case  msgSetProgram:
      onSetProgram(track, msg->dwAbsPos, msg->MsgData.ChangeProgram.iChannel, msg->MsgData.ChangeProgram.iProgram);
      break;
    case  msgChangePressure:
      onChangePressure(track, msg->dwAbsPos, msg->MsgData.ChangePressure.iChannel, msg->MsgData.ChangePressure.iPressure);
      break;
    case  msgSetPitchWheel:
      onSetPitchWheel(track, msg->dwAbsPos, msg->MsgData.PitchWheel.iChannel, msg->MsgData.PitchWheel.iPitch + 8192);
      break;
    case  msgMetaEvent:
      switch (msg->MsgData.MetaEvent.iType) {
      case  metaMIDIPort:
        onMetaMIDIPort(track, msg->dwAbsPos, msg->MsgData.MetaEvent.Data.iMIDIPort);
        break;
      case  metaSequenceNumber:
        onMetaSequenceNumber(track, msg->dwAbsPos, msg->MsgData.MetaEvent.Data.iSequenceNumber);
        break;
      case  metaTextEvent:
        onMetaTextEvent(track, msg->dwAbsPos, msg->MsgData.MetaEvent.Data.Text.pData);
        break;
      case  metaCopyright:
        onMetaCopyright(track, msg->dwAbsPos, msg->MsgData.MetaEvent.Data.Text.pData);
        break;
      case  metaTrackName:
        onMetaTrackName(track, msg->dwAbsPos, msg->MsgData.MetaEvent.Data.Text.pData);
        break;
      case  metaInstrument:
        onMetaInstrument(track, msg->dwAbsPos, msg->MsgData.MetaEvent.Data.Text.pData);
        break;
      case  metaLyric:
        onMetaLyric(track, msg->dwAbsPos, msg->MsgData.MetaEvent.Data.Text.pData);
        break;
      case  metaMarker:
        onMetaMarker(track, msg->dwAbsPos, msg->MsgData.MetaEvent.Data.Text.pData);
        break;
      case  metaCuePoint:
        onMetaCuePoint(track, msg->dwAbsPos, msg->MsgData.MetaEvent.Data.Text.pData);
        break;
      case  metaEndSequence:
        onMetaEndSequence(track, msg->dwAbsPos);
        break;
      case  metaSetTempo:
        setPlaybackTempo(midiFile, msg->MsgData.MetaEvent.Data.Tempo.iBPM);
        onMetaSetTempo(track, msg->dwAbsPos, msg->MsgData.MetaEvent.Data.Tempo.iBPM);
        break;
      case  metaSMPTEOffset:
        onMetaSMPTEOffset(track, msg->dwAbsPos,
          msg->MsgData.MetaEvent.Data.SMPTE.iHours,
          msg->MsgData.MetaEvent.Data.SMPTE.iMins,
          msg->MsgData.MetaEvent.Data.SMPTE.iSecs,
          msg->MsgData.MetaEvent.Data.SMPTE.iFrames,
          msg->MsgData.MetaEvent.Data.SMPTE.iFF
          );
        break;
      case  metaTimeSig:
        // TODO: Metronome and thirtyseconds are missing!!!
        onMetaTimeSig(track,
          msg->dwAbsPos,
          msg->MsgData.MetaEvent.Data.TimeSig.iNom,
          msg->MsgData.MetaEvent.Data.TimeSig.iDenom / MIDI_NOTE_CROCHET,
          0, 0
          );
        break;
      case  metaKeySig: // TODO: scale is missing!!!
        onMetaKeySig(track, msg->dwAbsPos, msg->MsgData.MetaEvent.Data.KeySig.iKey, 0);
        break;
      case  metaSequencerSpecific:
        onMetaSequencerSpecific(track, msg->dwAbsPos,
        msg->MsgData.MetaEvent.Data.Sequencer.pData, msg->MsgData.MetaEvent.Data.Sequencer.iSize);
        break;
      }
      break;

    case  msgSysEx1:
    case  msgSysEx2:
      onMetaSysEx(track, msg->dwAbsPos, msg->MsgData.SysEx.pData, msg->MsgData.SysEx.iSize);
      break;
    }
}

BOOL playMidiFile(const char *pFilename) {
  _MIDI_FILE* pMFembedded;
  BOOL open_success;
  int32_t timeToWait = 0;

  pMFembedded = midiFileOpen(pFilename);
  open_success = pMFembedded != NULL;

  if (!open_success) {
    return FALSE;
  }

  static MIDI_MSG msg[MAX_MIDI_TRACKS];
  static MIDI_MSG msgEmbedded[MAX_MIDI_TRACKS];
  int32_t any_track_had_data = 1;
  uint32_t current_midi_tick = 0;
  uint32_t ticks_to_wait = 0;
  int32_t iNumTracks = midiReadGetNumTracks(pMFembedded);

  for (int32_t iTrack = 0; iTrack < iNumTracks; iTrack++) {
    midiReadInitMessage(&msgEmbedded[iTrack]);
    midiReadGetNextMessage(pMFembedded, iTrack, &msgEmbedded[iTrack]);
  }

