c-base/floppy_orgel/firmware/stm32f407/portable/main.c
  printf("Midi Format: %d\n\r", pMFembedded->Header.iVersion);
  printf("Number of tracks: %d\n\r", iNumTracks);
  printf("Start playing...\n\r");

  while (any_track_had_data) {
    any_track_had_data = 1;
    ticks_to_wait = -1;

    for (int32_t iTrack = 0; iTrack < iNumTracks; iTrack++) {
      while (current_midi_tick == pMFembedded->Track[iTrack].pos && pMFembedded->Track[iTrack].ptrNew < pMFembedded->Track[iTrack].pEndNew) {
        dispatchMidiMsg(pMFembedded, iTrack, &msgEmbedded[iTrack]);

        if (midiReadGetNextMessage(pMFembedded, iTrack, &msgEmbedded[iTrack])) {
          any_track_had_data = 1; // 0 ???
        }
      }

      // TODO: make this line of hell readable!
      ticks_to_wait = ((int32_t)(pMFembedded->Track[iTrack].pos - current_midi_tick) > 0 && ticks_to_wait > pMFembedded->Track[iTrack].pos - current_midi_tick) ? pMFembedded->Track[iTrack].pos - current_midi_tick : ticks_to_wait;
    }

    if (ticks_to_wait == -1)
      ticks_to_wait = 0;

    // wait microseconds per tick here
    timeToWait = TIM2->CNT + ticks_to_wait * pMFembedded->msPerTick * 1000;
    while (TIM2->CNT < timeToWait); // just wait here...
    current_midi_tick += ticks_to_wait;
  }
  midiFileClose(pMFembedded);

  return TRUE;
}


BOOL playMidiFile2(const char *pFilename) {
  _MIDI_FILE* pMFembedded;
  static MIDI_MSG msgEmbedded[MAX_MIDI_TRACKS];

  pMFembedded = midiFileOpen(pFilename);
  if (!pMFembedded) {
    return FALSE;
  }
  int32_t iNumTracks = midiReadGetNumTracks(pMFembedded);

  printf("Midi Format: %d\n\r", pMFembedded->Header.iVersion);
  printf("Number of tracks: %d\n\r", iNumTracks);
  printf("Start playing...\n\r");

  // Load initial midi events
  for (int iTrack = 0; iTrack < iNumTracks; iTrack++) {
    midiReadGetNextMessage(pMFembedded, iTrack, &msgEmbedded[iTrack]);
    pMFembedded->Track[iTrack].deltaTime = msgEmbedded[iTrack].dt;
  }

  int32_t startTime = hal_clock();
  int32_t currentTick = 0;
  int32_t lastTick = 0;
  int32_t deltaTick; // Must NEVER be negative!!!
  BOOL eventsNeedToBeFetched = FALSE;
  BOOL trackIsFinished;
  BOOL allTracksAreFinished = FALSE;
  float lastMsPerTick = pMFembedded->msPerTick;
  float timeScaleFactor = 1.0f;

  while (!allTracksAreFinished) {
    if (fabs(lastMsPerTick - pMFembedded->msPerTick) > 0.01f) {
      // On a tempo change we need to transform the old absolute time scale to the new scale.
      timeScaleFactor = lastMsPerTick / pMFembedded->msPerTick;
      lastTick *= timeScaleFactor;
    }

    lastMsPerTick = pMFembedded->msPerTick;
    currentTick = (hal_clock() - startTime) / pMFembedded->msPerTick;
    eventsNeedToBeFetched = TRUE;
    while (eventsNeedToBeFetched) { // This loop keeps all tracks synchronized in case of a lag
      eventsNeedToBeFetched = FALSE;
      allTracksAreFinished = TRUE;
      deltaTick = currentTick - lastTick;
      if (deltaTick < 0) printf("DEBUG: bug in delta tick: deltaTick=%d\r\n", deltaTick);

      for (int iTrack = 0; iTrack < iNumTracks; iTrack++) {
        pMFembedded->Track[iTrack].deltaTime -= deltaTick;
        trackIsFinished = pMFembedded->Track[iTrack].ptrNew == pMFembedded->Track[iTrack].pEndNew;

        if (!trackIsFinished) {
          if (pMFembedded->Track[iTrack].deltaTime <= 0 && !trackIsFinished) { // Is it time to play this event?
            dispatchMidiMsg(pMFembedded, iTrack, &msgEmbedded[iTrack]); // shoot
            midiReadGetNextMessage(pMFembedded, iTrack, &msgEmbedded[iTrack]); // reload
            pMFembedded->Track[iTrack].deltaTime += msgEmbedded[iTrack].dt;
          }

          if (pMFembedded->Track[iTrack].deltaTime <= 0 && !trackIsFinished)
            eventsNeedToBeFetched = TRUE;

          allTracksAreFinished = FALSE;
        }
        lastTick = currentTick; // Is not set, if there is no event to be dispatched. TODO: make more explicit?
      }
    }
  }
}

void debugMidiPlayer() {
  static char pMidiFile[256];
  static char dir[256] = { 0 };
  scan_files(dir);

  while(TRUE) {
    printf("Enter MIDI File: ");
    getFileNameFromUart(pMidiFile);

    //debug
    enableMidiTimer();
    RCC_TypeDef* rcc = RCC;
    RegSTM32F4_RCC_APB1ENR_t* apb1enr = &RCC->APB1ENR;
    //

    printf("Now playing midi file: %s\n\r", pMidiFile);
    _MIDI_FILE pMF;
    BOOL open_success = 0;
    if(!playMidiFile2(pMidiFile))
      printf("Opening failed!\n\r");
    else {
      printf("Done.\n\r");
    }
  }

  printf("Unmounting SD card...\n\r");
  f_mount(0, "0:", 1); /* Unmount SD card */

}

///////////

int main(void) {
  enableMidiTimer();
  initializeDebugUart(115200);
  initializeBusUart(9600);
  setupNesGamePad();
  union NesGamePadStates_t state;

  while(TRUE) {
    state = getNesGamepadState();
    if(state.code == 0xFF)
      printf("Game pad is not plugged in\n\r");
    else {
      printf("A: ");      if(state.states.A)      printf(" ON"); else printf("OFF"); printf(" | ");
      printf("B: ");      if(state.states.B)      printf(" ON"); else printf("OFF"); printf(" | ");
      printf("UP: ");     if(state.states.North)  printf(" ON"); else printf("OFF"); printf(" | ");
      printf("DOWN: ");   if(state.states.South)  printf(" ON"); else printf("OFF"); printf(" | ");
      printf("LEFT: ");   if(state.states.West)   printf(" ON"); else printf("OFF"); printf(" | ");
      printf("RIGHT: ");  if(state.states.East)   printf(" ON"); else printf("OFF"); printf(" | ");
      printf("START: ");  if(state.states.Start)  printf(" ON"); else printf("OFF"); printf(" | ");
      printf("SELECT: "); if(state.states.Select) printf(" ON"); else printf("OFF"); printf(" | ");
      printf("SPI recv: 0x%X\r\n", SPI2->DR);
    }
    delayMs(100);
  }

  // stop all drives
  for(int i = 0; i < 16; i++) {
    playNote(i, 0);
  }

  debugPrintln("\n\r");
  debugPrintln("################################");
  debugPrintln("Floppy Orgel v3.0 initialisiert.");
  debugPrintln("################################");

  FATFS SD_Fs;
  uint32_t free, total;

  /* Try to mount SD card */
  /* SD card is at 0: */
  printf("Mounting SD card... ");
  if (f_mount(&SD_Fs, "0:", 1) == FR_OK) {
    printf("success!\n\r"); /* Mounted ok */

    /* Get total and free space on SD card */
    TM_FATFS_DriveSize(&total, &free);

    /* Total space */
    printf("Total: %8u kB; %5u MB; %2u GB\r\n", total, total / 1024, total / 1048576);
    printf("Free:  %8u kB; %5u MB; %2u GB\r\n", free, free / 1024, free / 1048576);
  }
  else
    printf("Failed! No SD-Card?\r\n");

//  debugMidiPlayer();

  Delay(0x3FFFFF);
  LCD_Init();
  Delay(0x3FFFFF);
  LCD_Clear(BLACK);
  Delay(0x3FFFFF);

  UB_Rng_Init(); // Init the random number generator
  init_stars();
  LCD_Clear(GREEN);

  char c = 0;
  printf("now listening on serial port...\n\r");

  // Main Loop
  while(1) {
	  drawFrame();

	  /*
	  if(_USART_getc(USART1, &c)) {
	    while (USART_GetFlagStatus(USART6, USART_FLAG_TXE) == RESET); // Wait until transmit finishes
	      USART_SendData(USART6, c);
	  }
	  */
  }
}

